app/controllers/attaquer_controller.rb

  def index
    @mafraj = Mafraj.where.not(user_id: current_user.id).order("RANDOM()").limit(1)
---
SELECT  "mafrajs".* FROM "mafrajs" WHERE ("mafrajs"."user_id" != ?)  ORDER BY RANDOM() LIMIT 1  [["user_id", 1]]

  def attaquer
    zamels = params[:zamels]
    user_id_attaque = params[:user_id_attaque]
    mafraj = current_user.mafraj
    armee = mafraj.armee

    if !zamels.nil? && !user_id_attaque.nil?
      zamels = zamels.to_i

      if zamels > mafraj.armee.zamel
        flash[:error] = "Pas assez de zamels. N'essaye pas de tricher ou ton compte sera transformé en nigger."
      else
        user_id_attaque = user_id_attaque.to_i

        armee.zamel -= zamels
        armee.save
---
UPDATE "armees" SET "zamel" = ?, "updated_at" = ? WHERE "armees"."id" = ?  [["zamel", 64], ["updated_at", "2015-06-21 18:22:59.047792"], ["id", 1]]
UPDATE "mafrajs" SET "the_a_recolter" = ?, "fumee_a_recolter" = ?, "derniere_recole_the" = ?, "derniere_recolte_fumee" = ?, "updated_at" = ? WHERE "mafrajs"."id" = ?