app/controllers/highscore_controller.rb

  def index
    @mafraj = Mafraj.all.order('kebab desc')
---
SELECT "mafrajs".* FROM "mafrajs"  ORDER BY "mafrajs"."kebab" ASC, "mafrajs"."desc" ASC