app/controllers/mafraj_controller.rb

SELECT  "mafrajs".* FROM "mafrajs" WHERE "mafrajs"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
  def ameliorer
    message = current_user.mafraj.ameliorer params[:batiment]
    flash[:error] = message unless message.empty?