app/controllers/zamel_controller.rb

  def construire
    zamels = params[:zamels].to_i
    mafraj = current_user.mafraj

    if zamels > 0
      if mafraj.the >= zamels * 10 && mafraj.fumee >= zamels * 10
        mafraj.enlever_the(zamels * 10)
        mafraj.enlever_fumee(zamels * 10)

        FileAttente.new(mafraj_id: mafraj.id, type_file: "zamels", message: "#{zamels} zamels arrivent !", date_fin: Time.now + zamels.minutes).save
---
INSERT INTO "file_attentes" ("mafraj_id", "type_file", "message", "date_fin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)